{
    "profile": {
        "name": "Luís Teixeira",
        "position": "Software Engineer",
        "email": "luis.teixeira@lmteixeira.com",
        "phone": "+49 1522 535 82 06",
        "website": "http://www.lmteixeira.com",
        "github": "https://github.com/luisteixeira",
        "linkedin": "https://www.linkedin.com/in/luismotateixeira/",
        "location": {
            "country": "Germany",
            "state": "Hessen",
            "city": "Darmstadt",
            "postalCode": "64295"
        },
        "summary": [
            "Software Engineer based in Darmstadt.",
            "Since graduating in 2014 I have been as a Software Engineer in the Space Sector.",
            "Although mainly working as a backend engineering I am also passionate about frontend development and DevOps."
        ]
    },
    "workExperience": [
        {
            "company": "VisionSpace Technologies, Lda",
            "position": "Intern Software Engineer",
            "current": false,
            "startDate": "June 2013",
            "endDate": "September 2013",
            "summary": [
                "As Intern Software Engineer in VisionSpace Technologies, I participated in the design and implementation of an energy measurement tool in order to measure software power consumption;",
                "The intensive use of computing resources in the aerospace sector plays an important role to the planning, implementation and maintenance of space missions. Knowing that nearly 90% of energy consumption in a computer system happens because of software execution, GreenSSCM optimizes energy consumption via software for software components for this sector. GreenSSCM transforms high level software code into more suitable software code that performs the same task but consumes less energy.",
                "In the scope of the GreenSSCM project I developed a platform for measuring software energy consumption. This tool was developed in Python and integrated with Jenkins allows the user automate a set of tests in order check the energy consumption of a given software."
            ],
            "achievments": [
                "Ulisses Costa, Luís Teixeira, Miguel Lordelo, Tiago Carvalho, Orlando Belo, Victor Fonte, Pedro Henriques, António Ribeiro and João Saraiva. GreenSSCM: Green Software for Space Control Missions. Paper presented at IT4ENERGY, April 2015.",
                "Implementation of a Energy Measurement tool in python capable of compile, run and collect the power consumption from an external device;",
                "Familiarization with GCC and it's code optimization mechanism;",
                "Use of distributed computing in the implementation of Energy Measurement tool for the GreenSSCM project, making use of python's dispy library;",
                "Implementation of XML reports for the measurements."
            ],
            "keywords": [
                "Python",
                "Dispy",
                "GCC",
                "C",
                "C++",
                "XML",
                "Linux",
                "Git"
            ],
            "location": {
                "country": "Portugal",
                "state": "Porto",
                "city": "Matosinhos",
                "postalCode": "4454"
            }
        },
        {
            "company": "VisionSpace Technologies, Lda",
            "position": "Software Engineer",
            "current": false,
            "startDate": "March 2014",
            "endDate": "June 2016",
            "summary": [
                "After finishing my degree I returned to VisionSpace Technologies where I had previous worked as an Intern Software Engineer.",
                "During my time in VisionSpace Technologies offices in Portugal I was part of different projects mostly as a Backend Developer.",
                "I continued to work on the GreenSSCM project in colaboration with the computer science department of Minho's University.",
                "After the conclusion of the GreenSSCM project I started as main developer on the EUDART project for the European Space Agency. EUDART it's a tool used by the European Space Agency to design and perform regression tests on some their ground segment software. The project was developed in Java using the Eclipse RCP framework.",
                "Parellel to the development of EUDART I was also involved in the VSTART project, an implementation of EUDART for the web. VSTART shared the same core functionality and code base with EUDART with some improvemnets on top in order to make the product more comercially appealing. Besides the development of the backend I was also working closely with people working in the frontend.",
                "At the end of my time in the portuguese office of the company I was offered the opportunity to work in a project at the European Space Operations Center in Darmstadt. The project with the duration of 3 months had the main objective of implementing a continuous integration and delivery process for the Ground Data Systems department. A case study system was implemented using tools such as: Jenkins, Nexus and SaltStack. The project was successful and the Angency decided to move on with a full scale project, with some minor changes, ie: replacing SaltStack with Chef."
            ],
            "achievments": [
                "Massive improvment of my soft skills as a result of the GreenSSCM investigation project and the necessity of continously present the results to all the external partners;",
                "Being the main developer on a project for a important client;",
                "Developing a code base that was used in multiple projects;",
                "Successfully implementing a case study project in the European Space Agency."
            ],
            "keywords": [
                "Java",
                "Python",
                "Grails",
                "Eclipse RCP",
                "MySQL",
                "SaltStack",
                "Jenkins",
                "Maven",
                "Nexus",
                "Git",
                "Docker",
                "XML",
                "YAML",
                "Linux",
                "Soft Skills"
            ],
            "location": {
                "country": "Portugal",
                "state": "Porto",
                "city": "Matosinhos",
                "postalCode": "4454"
            }
        },
        {
            "company": "VisionSpace Technologies, Gmbh",
            "position": "Software Engineer",
            "current": true,
            "startDate": "June 2016",
            "endDate": "",
            "summary":[
                "After working closely with the German office of VisionSpace and with the European Space Angency I was offered a position in the offices of VisionSpace in Darmstadt.",
                "Since my move to Germany in 2016 my job is diveded in two main parts: external contractor for the End to End test and validation department of the European Space Operations Center and Software(ESOC) Engineer for VisionSpace Technologies.",
                "As part of my work as an external contractor for ESOC I am part of a team responsible for the test and validation of all the Ground Segement Systems. We are responsible to take the latest versions of each system and perform intgration tests in order to guarantee that everything works together. Also as part of my position I am responsible to maintain the continuous integration and delivery system.",
                "As a Software Engineer I was involved different projects, mostly a backend developer but sometimes assuming a fullstack role. During this time in the German offices of VisionSpace I was involved in two main projects both using mostly a Java technology stack.",
                "The first of these projects is being developed for the European Space Agency and is based on Eclipse Che, an open source web IDE maintained by the Eclipse Foundation.",
                "The second it's an comercial project developed using an microservice architecture. I am the main responsible for the service responsible for collecting data from external sources and providing it via a RESTApi to other services. Different technologies are being used accross the project with me working mostly with a JVM stack and Spring Framework. Since the project is being developed by a small team, I also had the opportunity of working on different parts of the project and gain some experience with other Technologies such as: ReactJS, Rasa.ai and OrientDB.",
                "Also as part of my work as a Software Engineer in VisionSpace I gained valuable experience on the contanarization and tools such as Docker and Kubernetes."
            ],
            "achievments": [
                "I aquired valuable knowledge about the end to end Groung Segment Systems and protocols;",
                "Being a key member of two main projects, having responsabilities on the architecture and design;",
                "Move to a (Micro)service oriented architecture;"
            ],
            "keywords": [
                "Java",
                "Spring",
                "Netflix Stack",
                "Python",
                "ReactJS",
                "Rasa.ai",
                "Eclipse RCP",
                "OrientDB",
                "MySQL",
                "SaltStack",
                "Chef",
                "Jenkins",
                "Maven",
                "Nexus",
                "Git",
                "Docker",
                "Kubernetes",
                "XML",
                "YAML",
                "Linux",
                "Soft Skills"
            ],
            "location": {
                "country": "Germany",
                "state": "Hessen",
                "city": "Darmstadt",
                "postalCode": "64283"
            }
        }
    ],
    "education": [
        {
            "institution": "Instituto Superior de Engenharia do Porto",
            "course": "Software Engineering",
            "degree": "B.Eng.",
            "endDate": "June 2014"
        }
    ],
    "skills": [
        {
            "name": "Java",
            "value": 90
        },
        {
            "name": "Spring",
            "value": 70
        }, {
            "name": "Python",
            "value": 70
        },
        {
            "name": "Linux",
            "value": 90
        },
        {
            "name": "Docker",
            "value": 70
        },
        {
            "name": "Javascript",
            "value": 65
        },
        {
            "name": "React",
            "value": 65
        },
        {
            "name": "NodeJS",
            "value": 60
        },
        {
            "name": "RabitMQ",
            "value": 60
        },
        {
            "name": "Angular",
            "value": 60
        },
        {
            "name": "C++",
            "value": 55
        },
        {
            "name": "MySQL",
            "value": 60
        },
        {
            "name": "Micronaut",
            "value": 50
        },
        {
            "name": "Go",
            "value": 50
        },
        {
            "name": "C",
            "value": 50
        },
        {
            "name": "SaltStack",
            "value": 65
        },
        {
            "name": "Chef",
            "value": 55
        }
    ],
    "languages": [
        {
            "language": "Portuguese",
            "level": "Native",
            "levelNumber": 100
        },
        {
            "language": "English",
            "level": "Business Fluent",
            "levelNumber": 95
        },
        {
            "language": "Spanish",
            "level": "Proficient",
            "levelNumber": 70
        },
        {
            "language": "German",
            "level": "Beginner",
            "levelNumber": 10
        }
    ]
}